import '../models/exam_model.dart';

const String studentIndex = '221033';

List<Exam> studentExams = [
  Exam(
    subject: 'Алгоритми и податочни структури',
    dateTime: DateTime(2024, 2, 14, 9, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Компјутерски мрежи и безбедност',
    dateTime: DateTime(2024, 1, 15, 13, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб'],
  ),
  Exam(
    subject: 'Напредно програмирање',
    dateTime: DateTime(2024, 9, 3, 8, 0),
    rooms: ['ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Веројатност и статистика',
    dateTime: DateTime(2024, 1, 17, 9, 0),
    rooms: ['223 ФЕИТ', '225 ФЕИТ', 'Б3.2'],
  ),
  Exam(
    subject: 'Оперативни системи',
    dateTime: DateTime(2024, 6, 28, 12, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб'],
  ),
  Exam(
    subject: 'Бази на податоци',
    dateTime: DateTime(2025, 8, 27, 9, 30),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Дизајн и архитектура на софтвер',
    dateTime: DateTime(2025, 1, 15, 14, 0),
    rooms: ['ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Програмирање на видео игри',
    dateTime: DateTime(2025, 2, 20, 10, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Веб програмирање',
    dateTime: DateTime(2025, 11, 21, 8, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Шаблони за дизајн на кориснички интерфејси',
    dateTime: DateTime(2025, 11, 18, 10, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Имплементација на системи со слободен и отворен код',
    dateTime: DateTime(2025, 11, 19, 9, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13'],
  ),
  Exam(
    subject: 'Мобилни информациски системи',
    dateTime: DateTime(2025, 12, 20, 13, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Вовед во науката за податоци',
    dateTime: DateTime(2025, 11, 29, 8, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
  Exam(
    subject: 'Структурно програмирање',
    dateTime: DateTime(2023, 9, 15, 8, 0),
    rooms: ['ЛАБ. 138', 'ЛАБ. 13', 'ЛАБ. 200аб', 'ЛАБ. 215', 'ЛАБ. 200в'],
  ),
];
